#ნამრავლის გამოთვლა: დაწერეთ ალგორითმი, რომელიც დაბეჭდავს სიის ყველა ელემენტის ნამრავლს.

# list = [10,14,15,5,4,8,13,6]

# Multiplied_numbers =  1

# for i in list:
#   Multiplied_numbers *= i


# print(Multiplied_numbers)


#უარყოფითი რიცხვების ამოღება: დაწერეთ ალგორითმი, რომელიც მიიღებს მთელ რიცხვთა სიას და ამოიღებს ყველა უარყოფით რიცხვს, დაბეჭდავს ახალ სიას ამ ელემენტების გარეშე.

# def remove_negatives(numbers):
#     non_negatives = []
#     for number in numbers:
#         if number >= 0:
#             non_negatives.append(number)
#     return non_negatives




#საშუალოს პოვნა: დაწერეთ ალგორითმი, რომელიც მიიღებს სიას და დააბრუნებს მის საშუალო არითმეტიკულს.

# list = [14, 6, 13, 40, 27, 31, 19, 22]
 
# sum = sum(list)
# len = len(list)
# average = sum / list
# print(average)



#სიების შეერთება: დაწერეთ ალგორითმი, რომელიც მიიღებს ორ რიცხვთა სიას, გააერთიანებს მათ ერთ სიაში და ამ სახით დაბეჭდავს.

# num1 = [1, 2, 3, 4, 5]
# num2 = [6, 7, 8, 9, 10]
# numbers = num1 + num2
# print(numbers)

#დუბლიკატების სია: დაწერეთ ალგორითმი, რომელიც მიიღებს სიას. თქვენ შემდეგ ამ სიის დუბლიკატებს გადაიტანთ ახალ სიაში და დაბეჭდავთ მას.





